ednieuw/Arduino-ESP32-Nano-Wordclock/ESP32_WordClockV184/ESP32_WordClockV184.ino
void DitLeHeure(void)
{
 byte sayhour = timeinfo.tm_hour;
 if (timeinfo.tm_min > 33 ) sayhour = timeinfo.tm_hour+1;
 if (sayhour == 24) sayhour = 0;

switch (sayhour)
 {
  case 13:  
  case 1:  UNE;    HEURE;  break;
  case 14:
  case 2:  DEUX;   HEURES;  break;
  case 15:
  case 3:  TROIS;  HEURES;  break;
  case 16:
  case 4:  QUATRE; HEURES; break;
  case 17:
  case 5:  CINQ;   HEURES;   break;
  case 18:
  case 6:  SIX;    HEURES;   break;
  case 19:
  case 7:  SEPT;   HEURES;  break;
  case 20:
  case 8:  HUIT;   HEURES; break;
  case 21:
  case 9:  NEUF;   HEURES; break;
  case 22:
  case 10: DIX;    HEURES; break;
  case 23:
  case 11: ONZE;   HEURES; break;
  case 0:  MINUIT; break;
  case 12: MIDI;   break;
 } 
}
                     #endif //FR

//------------------ BLE

//--------------------------------------------                                                //
// BLE SendMessage by BLE Slow in packets of 20 chars
// or fast in one long string.
// Fast can be used in IOS app BLESerial Pro
//--------------------------------------------
void SendMessageBLE(std::string Message)
{
 if(BLEConnected) 
   {
    if (Mem.UseBLELongString)                                                                 // If Fast transmission is possible
     {
      pTxCharacteristic->setValue(Message); 
      pTxCharacteristic->notify();
      delay(10);                                                                              // Bluetooth stack will go into congestion, if too many packets are sent
     } 
   else                                                                                       // Packets of max 20 bytes
     {   
      int parts = (Message.length()/20) + 1;
      for(int n=0;n<parts;n++)
        {   
         pTxCharacteristic->setValue(Message.substr(n*20, 20)); 
         pTxCharacteristic->notify();
         delay(10);                                                                           // Bluetooth stack will go into congestion, if too many packets are sent
        }
     }
   } 
}

//--------------------------------------------                                                //
// BLE Start BLE Classes NimBLE Version 2.x.x
//--------------------------------------------
class MyServerCallbacks: public NimBLEServerCallbacks 
{
 void onConnect(NimBLEServer* pServer, NimBLEConnInfo& connInfo) override 
    {BLEConnected = true; Tekstprintln("BLE Connected"   );}
 void onDisconnect(NimBLEServer* pServer, NimBLEConnInfo& connInfo, int reason) override 
    {BLEConnected = false; Tekstprintln("BLE Disconnected" );}
};
  
class MyCallbacks: public NimBLECharacteristicCallbacks 
{
 void onWrite(NimBLECharacteristic *pCharacteristic, NimBLEConnInfo& connInfo) override  
  {
   std::string rxValue = pCharacteristic->getValue();
   ReceivedMessageBLE = rxValue + "\n";
  //  if (rxValue.length() > 0) {for (int i = 0; i < rxValue.length(); i++) printf("%c",rxValue[i]); }  printf("\n");
  }  
};

//--------------------------------------------                                                //
// BLE Start BLE Service
//--------------------------------------------
void StartBLEService(void)
{
 NimBLEDevice::init(Mem.BLEbroadcastName);                                                    // Create the BLE Device
 pServer = NimBLEDevice::createServer();                                                      // Create the BLE Server
 pServer->setCallbacks(new MyServerCallbacks());
 BLEService *pService = pServer->createService(SERVICE_UUID);                                 // Create the BLE Service
 pTxCharacteristic                     =                                                      // Create a BLE Characteristic 
     pService->createCharacteristic(CHARACTERISTIC_UUID_TX, NIMBLE_PROPERTY::NOTIFY);                 
 BLECharacteristic * pRxCharacteristic = 
     pService->createCharacteristic(CHARACTERISTIC_UUID_RX, NIMBLE_PROPERTY::WRITE);
 pRxCharacteristic->setCallbacks(new MyCallbacks());
 pService->start(); 
 BLEAdvertising *pAdvertising = NimBLEDevice::getAdvertising();
 pAdvertising->addServiceUUID(SERVICE_UUID); 
 pAdvertising->setName(Mem.BLEbroadcastName);
 pServer->start();                                                                            // Start the server  Nodig??
 pServer->getAdvertising()->start();    
    // Add this to keep advertising running
 //   pAdvertising->setConnectable(true);                                                     // Start advertising
 TekstSprint("BLE Waiting a client connection to notify ...\n"); 
}

//--------------------------------------------                                                //
// BLE CheckBLE input and rework string
// After 1/4 hour the BLE connection is disconnected
//--------------------------------------------
void CheckBLE(void)
{
if (BLEConnected && !oldBLEConnected) 
  {
   oldBLEConnected = BLEConnected;
   BLEConnectedSince = millis();                                                              // Mark time of last connection 1/4 hour after this time the BLE connection will disconnect
  }
if (!BLEConnected && oldBLEConnected)                                                        // If device is disconnected start advertising
  {
   delay(300);
   pServer->startAdvertising();
   TekstSprint("Start advertising\n");
   oldBLEConnected = BLEConnected;
   BLEConnectedSince = 0;                                                                     // Reset BLE connection timer
  }
if ((BLEConnected && BLEConnectedSince > 0) && (millis() - BLEConnectedSince > 900000))       // Disconnect if connected longer than 15 minutes inactivity 
  {
   auto connHandles = NimBLEDevice::getServer()->getPeerDevices();                            // Vector of uint16_t handles
   if (!connHandles.empty()) 
     {
      uint16_t conn_handle = connHandles[0];
      int rc = ble_gap_terminate(conn_handle, BLE_ERR_REM_USER_CONN_TERM);                    // Reason = 0x13 = user terminated
      if (rc == 0) { TekstSprint("Disconnected BLE client after 1/4 hour\n"); } 
      else {snprintf(sptext, sizeof(sptext),"BLE disconnect failed, error: %d\n", rc); TekstSprint(sptext);}
       BLEConnectedSince = 0;
      }
  }
 if(ReceivedMessageBLE.length()>0)
   {
    SendMessageBLE(ReceivedMessageBLE);
    String BLEtext = ReceivedMessageBLE.c_str();
    ReceivedMessageBLE = "";
    ReworkInputString(BLEtext); 
    BLEConnectedSince = millis();                                                             // Mark time of last connection 1/4 hour after this time the BLE connection will disconnect
   }
}

// --------- TimeSender
//--------------------------------------------                                                //
// BLE TimeSender client
//--------------------------------------------
void SendMessageTimeSender(const char* msg)
{
 if (!TSConnected || !msg || !pRemoteRX || !pClient) return;
 if (!pClient->isConnected()) { TSConnected = false; return; }
 size_t len = strlen(msg);
 pRemoteRX->writeValue((uint8_t*)msg, len, false);
}


