ednieuw/Arduino-ESP32-Nano-Wordclock/ESP32_WordClockV184/ESP32_WordClockV184.ino
//--------------------------------------------                                                //
// WIFI Start WIFI connection and NTP service
//--------------------------------------------
bool StartWIFI_NTP(void)
{
 WiFi.disconnect(true,true);                                                                  // Remove all previous settings and entered SSID and password
 delay(100);
 WiFi.setHostname(Mem.BLEbroadcastName);                                                      // Set the host name in the WIFI router instead of a cryptic esp32 name
 WiFi.mode(WIFI_STA);  
 WiFi.config(INADDR_NONE, INADDR_NONE, INADDR_NONE, INADDR_NONE);
 WIFIwasConnected = false;
 WiFi.begin(Mem.SSID, Mem.Password);
 wifiEventHandler = WiFi.onEvent(WiFiEvent);                                                  // Using WiFi.onEvent interrupts and crashes IL9341 screen display while writing the screen
 MDNS.begin(Mem.BLEbroadcastName);                                                            // After reset http://wordclock.local 

 int tryDelay = 5000;                                                                         // Will try for about 50 seconds (10 x 5sec)
 int numberOfTries = 10;
 while (true)                                                                                 // Wait for the WiFi event
  {
    switch(WiFi.status()) 
    {
     case WL_NO_SSID_AVAIL:
          Tekstprintln("[WiFi] SSID not found (Unexpected error)\n Is the router turned off?");
          if(Mem.WIFIcredentials == SET_AND_OK)
            {
             Tekstprintln("[WiFi] Waiting 20 seconds for router to start");
             for( int n=0; n<10; n++)  { delay(2000); LEDstartup(red); }
            }
          if (WiFi.status() == WL_CONNECTED)  
            {
             WIFIwasConnected = true;                                                         // Now we know the SSID ans password are correct and we can reconnect
             CheckRestoreWIFIconnectivity();
            break;
            } 
          else return false;         
     case WL_CONNECT_FAILED:
          Tekstprint("[WiFi] Failed - WiFi not connected! Reason:? \n Reset the clock with option R and re-enter SSID and Password.");
          return false;
     case WL_CONNECTION_LOST:
          Tekstprintln("[WiFi] Connection was lost");
          break;
     case WL_SCAN_COMPLETED:
          Tekstprintln("[WiFi] Scan is completed");
          break;
     case WL_DISCONNECTED:
          Tekstprintln("[WiFi] WiFi is disconnected, will reconnect");
          WiFi.reconnect();
          break;
     case WL_CONNECTED:
          WIFIwasConnected = true;                                                            // Now we know the SSID ans password are correct and we can reconnect
          break;
     default:
     Tekstprintlnf("[WiFi] WiFi Status: %d", WiFi.status());
          break;
    } 
  LEDstartup(orange);                                                                         // Orange colour in WS2812 and SK6812 LEDs
  if (WIFIwasConnected) break;       
  if(numberOfTries <= 0)
    {
     Tekstprintln("[WiFi] Failed to connect to WiFi!");
     WiFi.disconnect();                                                                       // Use disconnect function to force stop trying to connect
     switch(Mem.WIFIcredentials)
        {    
         case NOT_SET:
             Tekstprintln("Check SSID and password or turn WIFI in menu off with option W");
             break;               
         case SET:
             Tekstprintln("Check your SSID name and password.\nRe-enter your password with option B in the menu. Password is now deleted");    
             strcpy(Mem.Password,"");                                                         // This will force a restart is AP mode. PWD can not be checked in menu. SSID can be checked
             break;
         case SET_AND_OK:
             Tekstprintln("Check WIFI router. The router is probably turned off");                  
             break;       
         case IN_AP_NOT_SET:    
         default:    
             Tekstprintln("Unknown condition. Re-enter SSID and password. They are deleted.\nOr turn WIFI in the menu with option W off");      
             strcpy(Mem.SSID,"");
             strcpy(Mem.Password,"");  
             break;
         }
        return false;
     } 
  else 
      { 
       delay(tryDelay);  
       numberOfTries--;    
      }
  }
if (!WIFIwasConnected) return false;                                                          // If WIFI connection fails -> return
//  snprintf(sptext, sizeof(sptext), "IP Address: %d.%d.%d.%d", WiFi.localIP()[0], WiFi.localIP()[1], WiFi.localIP()[2], WiFi.localIP()[3] );  Tekstprintln(sptext); 
if(Mem.NTPOn )
  { 
   initSNTP();
   if(wait4SNTP())  Tekstprintln("NTP is On and synced");
   else             Tekstprintln("NTP is On but NOT synced");
   }   
 if(Mem.WIFIOn) WebPage();                                                                    // Show the web page if WIFI is on
 Tekstprintln("Web page started");
 return true;
// WiFi.removeEvent(wifiEventHandler);  You can leave it on because it undertakes no actions. Every minute there is a connectivity check  // Remove the WIFI event handler
}

//--------------------------------------------                                                //
// NTP functions
//--------------------------------------------
void NTPnotify(struct timeval* tv) { ntpJustSynced = true; }                                  // --- NTP time synchronized --- is printed later
void CheckandPrintNTPsynced(void)
{
 struct tm tm;
 time_t now = time(nullptr);
 localtime_r(&now, &tm); 
 snprintf(sptext, sizeof(sptext),"-- NTP time synchronized --  %02d-%s-%04d %02d:%02d:%02d ",
           timeinfo.tm_mday,  monthNames[timeinfo.tm_mon],   // tm_mon is 0–11
           timeinfo.tm_year + 1900, timeinfo.tm_hour,
           timeinfo.tm_min,          timeinfo.tm_sec);
 Tekstprintln(sptext);
 ntpJustSynced = false;
}

void setTimezone() { setenv("TZ", Mem.Timezone, 1);  tzset(); }
void initSNTP() 
{  
 sntp_set_time_sync_notification_cb(NTPnotify);                                               // Optional: callback when time syncs
 configTime(0, 0, "pool.ntp.org", "time.nist.gov");                                           // 1 hour sync interval = default
 setTimezone();                                                                               // Must be set after configTime
}
//--------------------------------------------                                                //
// NTP Get a NTP time and wait max 2.5 sec 
//--------------------------------------------
bool wait4SNTP() 
{
 int32_t Tick = millis(); 
 bool SNTPtimeValid = true;
 while (sntp_get_sync_status() != SNTP_SYNC_STATUS_COMPLETED) 
  { if ((millis() - Tick) >2500) {SNTPtimeValid = false; break;}   }                          // Wait max 2.5 seconds 
return  SNTPtimeValid;
}

//--------------------------------------------                                                //
// WIFI WEBPAGE 
//--------------------------------------------
void WebPage(void) 
{
 int i = 0, n;
 DoNotLog = true;
 SWversion();                                                                                 // Print the menu to the web page and BLE
 DoNotLog = false;                                                                            // If i or ii was entered DoNotLog is still true to prevent logging of the SWversion()
 for (n=0;n<strlen(index_html_top);n++)       HTML_page[i++] = (char) index_html_top[n];
 if( i > MAXSIZE_HTML_PAGE - 999) 
   {  
    strcat(HTML_page, "<br> Send I for menu\n*** INCREASE MAXSIZE_HTML_PAGE in Webpage.h ***<br><br><br>");
   }
 else
   {
    for (n=0;n<strlen(html_info);n++)         HTML_page[i++] = (char) html_info[n];
    for (n=0;n<strlen(index_html_footer);n++) HTML_page[i++] = (char) index_html_footer[n];
    HTML_page[i]=0;
   }
 server.on("/", HTTP_GET, [](AsyncWebServerRequest *request)                                  // Send web page with input fields to client
   {  request->send(200, "text/html",(const char*) HTML_page  );  }    ); 
                                                                                              // Ringbuffer Web server endpoint for log data
 server.on("/log", HTTP_GET, [](AsyncWebServerRequest *request)                               // Serve the log viewer HTML page
   {  request->send(200, "text/html", logData);    });                                        // Serve the HTML page from LogViewer.h
 server.on("/tekstprint",  HTTP_GET, HandleTekstPrint);
 server.on("/tekstdownload", HTTP_GET, HandleTekstDownload);
 
 server.on("/get", HTTP_GET, [] (AsyncWebServerRequest *request)                              // Send a GET request to <ESP_IP>/get?input1=<inputMessage>
   { 
    String inputMessage;    String inputParam;
    if (request->hasParam(PARAM_INPUT_1))                                                     // GET input1 value on <ESP_IP>/get?input1=<inputMessage>
       {
        inputMessage = request->getParam(PARAM_INPUT_1)->value();
        inputParam = PARAM_INPUT_1;
       }
    else  {inputMessage = ""; inputParam = "none"; }                                          //inputMessage = "No message sent";

    bool NoInput = false;                                                                     // NoInput flashes a warning on the web page  
    if (!inputMessage.equalsIgnoreCase("Y")   && !inputMessage.equalsIgnoreCase("G") )        // Do not execute command via ReworkInputMessage && !inputMessage.equals("{")
        ReworkInputString(inputMessage);  
    else NoInput = true;                                                                      // Option Y en G inteferes with WIFI. This is a common issue when using AsyncWebServer with NeoPixels/RMT - it's caused by interrupt conflicts and timing issues.

    if (inputMessage.equalsIgnoreCase("i")  || inputMessage.equalsIgnoreCase("ii") )          // The SWversion() is printed to the web page to update the settings of the web page
         DoNotLog = true;                                                                     // but this should not be logged in the Logviewer only when i or i is entered.  

    html_info[0] = 0;                                                                         // clear html_info
    SWversion();                                                                              // Print the menu to the web page and BLE
    DoNotLog = false;
    int i=0,n;
    for (n=0;n<strlen(index_html_top);n++)    HTML_page[i++] = (char) index_html_top[n];
    for (n=0;n<strlen(html_info);n++)         HTML_page[i++] = (char) html_info[n];
    if (NoInput)                                                                              // Add a flashing text
      {
      // const char* msg = "<p class=\"verdana-warning\"> Option Y or G not possible from browser<br></p>";
       const char* msg =
        "<p id='warn' class='verdana-warningbg'>Option Y or G not possible from browser</p>"
        "<script>"
        "setTimeout(()=>{ let w=document.getElementById('warn');"
        "if(w){w.style.animation='none';}"
        "},5000);"
        "</script>";
       for (int n = 0; n < strlen(msg); n++) {   HTML_page[i++] = msg[n]; }
       NoInput=false;
      }
    for (n=0;n<strlen(index_html_footer);n++) HTML_page[i++] = (char) index_html_footer[n];
    HTML_page[i] = 0;        
    request->send(200, "text/html", HTML_page );  
   }   ); 

// Serve the OTA upload page
server.on("/update", HTTP_GET, [](AsyncWebServerRequest *request)
{  request->send(200, "text/html", OTA_html);});

server.on("/update", HTTP_POST, [](AsyncWebServerRequest *request) {                           // Handle the actual OTA upload
    shouldReboot = true;
    request->send(200, "text/html", 
      "<!DOCTYPE html><html><body>"
      "<h2>Update successful. Rebooting...</h2>"
      "<p>You will be redirected shortly.</p>"
      "<script>setTimeout(()=>{location.href='/'}, 7000);</script>"
      "</body></html>");
  }, 
  [](AsyncWebServerRequest *request, String filename, size_t index, uint8_t *data, size_t len, bool final) {
    if (!index) 
      {
       Tekstprintf("OTA Start: %s\n", filename.c_str());
       if (!Update.begin(UPDATE_SIZE_UNKNOWN)) { Update.printError(Serial);  }
      }
    if (Update.write(data, len) != len) { Update.printError(Serial);   }
    if (final) 
      {
       if (Update.end(true)) { Tekstprintf("OTA Success: %u bytes\n", index + len);  } 
       else {Update.printError(Serial); }
      }
  });
 server.onNotFound(notFound);
 server.begin();
}

//--------------------------------------------                                                //
// WIFI WEBPAGE 
//--------------------------------------------
void notFound(AsyncWebServerRequest *request) 
{
  request->send(404, "text/plain", "Not found");
}

//--------------------------------------------                                                //
// WIFI WEBPAGE Login credentials Access Point page with 192.168.4.1
//--------------------------------------------
void StartAPMode(void) 
{
 InApMode = true;
 Mem.WIFIcredentials = IN_AP_NOT_SET;
 WiFi.softAP(AP_SSID, AP_PASSWORD);
 dnsServer.start(53, "*", WiFi.softAPIP());
 Tekstprintln("\nConnect to StartWordcock in WIFI on your mobile.\nEnter password: wordclock\nThen in URL: 192.168.4.1 and enter router credentials");   
 server.on("/", HTTP_GET, [](AsyncWebServerRequest *request)
  { request->send(200,"text/html",SoftAP_html);  });
 server.on("/", HTTP_POST, [](AsyncWebServerRequest *request)
   {
    int params = request->params();
    for (int i = 0; i < params; i++) 
      {
       const AsyncWebParameter* p = request->getParam(i);
       if (p->name() == "ssid") { strcpy(Mem.SSID,p->value().c_str());       }
       if (p->name() == "pass") { strcpy(Mem.Password , p->value().c_str()); }
      }
    StoreStructInFlashMemory();
    server.on("/", HTTP_GET, [](AsyncWebServerRequest *request)                               // Send web page with input fields to client
      { request->send(200, "text/plain", "Credentials saved. Restarting...");  } );  
    Mem.WIFIcredentials = SET;
    StoreStructInFlashMemory();  
    delay(300);
    InApMode = false;
    ESP.restart();
   });
 server.begin();
 Tekstprintln("AP Mode Started");
 Tekstprintlnf("AP SSID: %s", AP_SSID);
 IPAddress ip = WiFi.softAPIP();
 Tekstprintlnf("AP IP Address: %u.%u.%u.%u", ip[0], ip[1], ip[2], ip[3]);
    
